<!--Вам потрібно розробити програму, яка рахувала б суму цифр числа введеного користувачем. -->
<!--Наприклад: є число 123, програма повинна обчислити суму цифр 1, 2, 3, = 6. -->

<?php
$input = readline("введіть число");
if (is_numeric($input)) {
    $sum = 0;

    for ($i = 0; $i < strlen($input); $i++) {
        $sum += $input[$i];
    }
    echo $sum;
}
else{
    echo "помилка";
}

//завдання 2
//Вам потрібно розробити програму, яка рахує кількість входжень, будь-якої,
//вибраної вами цифри у заданому значенні. Наприклад: цифра 5 в числі 442158755745 зустрічається 4 рази.

$number = 442158755745;
$whatwecount = 5;
$count = 0;

if(is_numeric($number) || is_numeric($whatwecount)){
    for($i = 0; $i < $number; $i++){
        if($number[$i] === $whatwecount){
            $count++;
        }
    }
    echo $count;
}

else{
    echo "помилка";
}

//завдання 3
//Розробіть програму, яка з числа 20 .. 45 знайде ті, які діляться на 5 і знайде суму цих чисел.
//Можна використовувати функцію fmod для визначення "ділиться число" або "не ділиться".

$summa = 0;
for($i = 20; $i < 45; $i++){
    if(fmod($i, 5) === 0){
        echo "$i, ";
        $summa += $i;
    }
}

// завдання 4
// Створити массив, заповнити його випадковими знаннями (можна використовувати функцію rand),
// знайти максимальне і мінімальне значення массива і поміняти їх місцями.




